
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Timo Körner</title>
	
  <meta name="viewport" content="width=device-width, initial-scale=1">

  <link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/4.5.0/css/bootstrap.min.css">
	  
<script>
window.onload = function(){

	arr = {
		Home: '', 
		Github: 'https://github.com/tik9',
		LinkedIn: 'https://linkedin.com/in/timo-körner-65ab601b1',
		Stackoverflow: 'https://stackoverflow.com/users/1705829/timo',
		Cv: 'output/cv_en.html'
		}
	for (key in arr) {
	  document.getElementById("links").innerHTML +='<li><a href='+ arr[key] +'>'+ key+ '</a></li>'
	}
}	

</script>
<style>
.space {
  padding-top: 40px;
  padding-bottom: 30px
}
</style>
</head>
<body>

<div class="jumbotron text-center">

  <h1>Timo Körner</h1>

  <p>IT Admin</p>

</div>
  
<div class="container">
  <div class="row">
    <div class="col-sm-4">
      <h3>About</h3>
      <p>I am a Freelancer</p>
    </div>
    <div class="col-sm-4">
      <h3>Interests</h3>
      <p>Developing in Javascript</p>
    </div>
    <div class="col-sm-4">
      <h3>Links</h3> 
<ul>
<div id=links></div>
</ul>
</div>
</div>

<h4>Blog</h4>  
  <h5>September 2020 </h6>

<h6>Contact form on a static site without <code>php</code></h6>
<ul>
<li><code>formspree.io</code> will be used</li>
<li>Example form tag: <code>&lt;form action='https://formspree.io/your-email-address' method='post'&gt;</code></li>
<li>An account at formspree.io is obligatory</li>
</ul>

<h4 class='space'>Contact</h4>
<form action='https://formspree.io/user153015@gmail.com' method='post'>
    
	 <div class="form-group">
    <label for="nam">Name</label>
    <input type="text" name=name class="form-control" id="name" placeholder="Enter your Name">
  </div>
  
      <div class="form-group">
    <label for="exampleInputEmail1">Email address</label>
    <input type="email" namee=email class="form-control" id="exampleInputEmail1" aria-describedby="emailHelp" placeholder="Enter email">
    <small id="emailHelp" class="form-text text-muted">We'll never share your email with anyone else.</small>
  </div>

	  <div class="form-group">
    <label for="Textarea1">Message</label>
    <textarea name=message class="form-control" id="extarea1" rows="3" name=textarea ></textarea>
  </div>
	<input type="hidden" name="_subject" value= 'email von Kontaktformular'>
  <button type="submit" class="btn btn-primary">Submit</button>

</form>

<div class=space>
<h4>Datenschutzerklärung</h4>
<h5>1. Datenschutz auf einen Blick</h5>
<h6>Allgemeine Hinweise</h6> <p>Die folgenden Hinweise geben einen einfachen &Uuml;berblick dar&uuml;ber, was mit Ihren personenbezogenen Daten passiert, wenn Sie diese Website besuchen. Personenbezogene Daten sind alle Daten, mit denen Sie pers&ouml;nlich identifiziert werden k&ouml;nnen. Ausf&uuml;hrliche Informationen zum Thema Datenschutz entnehmen Sie unserer unter diesem Text aufgef&uuml;hrten Datenschutzerkl&auml;rung.</p>
<h6>Datenerfassung auf dieser Website</h6> Wer ist verantwortlich f&uuml;r die Datenerfassung auf dieser Website? <p>Die Datenverarbeitung auf dieser Website erfolgt durch den Websitebetreiber. Dessen Kontaktdaten k&ouml;nnen Sie dem Impressum dieser Website entnehmen.</p> Wie erfassen wir Ihre Daten? <p>Ihre Daten werden zum einen dadurch erhoben, dass Sie uns diese mitteilen. Hierbei kann es sich z.&nbsp;B. um Daten handeln, die Sie in ein Kontaktformular eingeben.</p> <p>Andere Daten werden automatisch oder nach Ihrer Einwilligung beim Besuch der Website durch unsere IT-Systeme erfasst. Das sind vor allem technische Daten (z.&nbsp;B. Internetbrowser, Betriebssystem oder Uhrzeit des Seitenaufrufs). Die Erfassung dieser Daten erfolgt automatisch, sobald Sie diese Website betreten.</p> Wof&uuml;r nutzen wir Ihre Daten? <p>Ein Teil der Daten wird erhoben, um eine fehlerfreie Bereitstellung der Website zu gew&auml;hrleisten. Andere Daten k&ouml;nnen zur Analyse Ihres Nutzerverhaltens verwendet werden.</p> Welche Rechte haben Sie bez&uuml;glich Ihrer Daten? <p>Sie haben jederzeit das Recht, unentgeltlich Auskunft &uuml;ber Herkunft, Empf&auml;nger und Zweck Ihrer gespeicherten personenbezogenen Daten zu erhalten. Sie haben au&szlig;erdem ein Recht, die Berichtigung oder L&ouml;schung dieser Daten zu verlangen. Wenn Sie eine Einwilligung zur Datenverarbeitung erteilt haben, k&ouml;nnen Sie diese Einwilligung jederzeit f&uuml;r die Zukunft widerrufen. Au&szlig;erdem haben Sie das Recht, unter bestimmten Umst&auml;nden die Einschr&auml;nkung der Verarbeitung Ihrer personenbezogenen Daten zu verlangen. Des Weiteren steht Ihnen ein Beschwerderecht bei der zust&auml;ndigen Aufsichtsbeh&ouml;rde zu.</p> <p>Hierzu sowie zu weiteren Fragen zum Thema Datenschutz k&ouml;nnen Sie sich jederzeit unter der im Impressum angegebenen Adresse an uns wenden.</p>
<h5>2. Allgemeine Hinweise und Pflichtinformationen</h5>
<h6>Datenschutz</h6> <p>Die Betreiber dieser Seiten nehmen den Schutz Ihrer pers&ouml;nlichen Daten sehr ernst. Wir behandeln Ihre personenbezogenen Daten vertraulich und entsprechend der gesetzlichen Datenschutzvorschriften sowie dieser Datenschutzerkl&auml;rung.</p> <p>Wenn Sie diese Website benutzen, werden verschiedene personenbezogene Daten erhoben. Personenbezogene Daten sind Daten, mit denen Sie pers&ouml;nlich identifiziert werden k&ouml;nnen. Die vorliegende Datenschutzerkl&auml;rung erl&auml;utert, welche Daten wir erheben und wof&uuml;r wir sie nutzen. Sie erl&auml;utert auch, wie und zu welchem Zweck das geschieht.</p> <p>Wir weisen darauf hin, dass die Daten&uuml;bertragung im Internet (z.&nbsp;B. bei der Kommunikation per E-Mail) Sicherheitsl&uuml;cken aufweisen kann. Ein l&uuml;ckenloser Schutz der Daten vor dem Zugriff durch Dritte ist nicht m&ouml;glich.</p>
<h6>Hinweis zur verantwortlichen Stelle</h6> <p>Die verantwortliche Stelle f&uuml;r die Datenverarbeitung auf dieser Website ist:</p> <p>Timo K&ouml;rner<br />
Bergstr. 15<br />
85120 Hepberg</p>
</div>
</body>
</html>
